---
kind: method
id: M:Autodesk.Revit.DB.BRepBuilderEdgeGeometry.Dispose
source: html/4ad68cf2-e2e4-b69a-bbfa-bf7f84980c86.htm
---
# Autodesk.Revit.DB.BRepBuilderEdgeGeometry.Dispose Method

Releases all resources used by the BRepBuilderEdgeGeometry

## Syntax (C#)
```csharp
public void Dispose()
```